{
  "headline": "Privacy Policy",
  "lastUpdated": "September 16, 2025",
  "sections": [
    {
      "id": "1",
      "title": "Introduction",
      "description": "Clipposaurus.com is committed to protecting your privacy. This Privacy Policy explains how we collect, use, and safeguard your information when you use our file sharing service."
    },
    {
      "id": "2",
      "title": "Information We Collect",
      "description": "Content You Share. When you use our service, we temporarily store Text content you choose to share, code snippets you upload, files you upload for sharing, and programming language selections. Technical Information. We automatically collect certain technical information, including IP addresses for security and service provision, browser type and version, device information, access timestamps, and usage patterns and performance metrics.Analytics Data. We use Vercel Analytics and Speed Insights to collect page views and navigation patterns, performance metrics, geographic region (aggregated), and referrer information."
    },
    {
      "id": "3",
      "title": "How We Use Your Information",
      "description": "We use the collected information for the following purposes <strong>Service Provision:</strong> To enable file and text sharing between your devicesd<strong>Security:</strong> To detect and prevent abuse, spam, and security threatsd<strong>Performance:</strong> To monitor and improve service performanced<strong>Analytics:</strong> To understand usage patterns and improve user experienced<strong>Legal Compliance:</strong> To comply with applicable laws and regulationsd"
    },
    {
      "id": "4",
      "title": "Data Storage and Security",
      "description": "Encryption. All shared content is encrypted using industry-standard encryption methods before storage. This includes Text and code content encrypted before Redis storagedFiles encrypted before upload to cloud storage providersdUnique encryption keys generated for each sharing sessiond4.2 Storage Locations. Your data may be stored in the following locations <strong>Temporary Data:</strong> Redis cloud storage for share codes and metadatad<strong>File Storage:</strong> Multiple cloud providers including Cloudflare R2, Backblaze B2, and Storjd<strong>Analytics:</strong> Vercel infrastructure for usage analyticsd4.3 Data Retention. We maintain a strict data retention policy <strong>Shared Content:</strong> Automatically deleted after 1 hourd<strong>Access Logs:</strong> Retained for security purposes for up to 30 daysd<strong>Analytics Data:</strong> Aggregated and anonymized data may be retained longerd"
    },
    {
      "id": "5",
      "title": "Data Sharing and Disclosure",
      "description": "We do not sell, trade, or otherwise transfer your personal information to third parties, except in the following circumstances5.1 Service Providers. We may share data with trusted third-party service providers who assist us in operating our service <strong>Cloud Storage Providers:</strong> For file storage (Cloudflare, Backblaze, Storj)d<strong>Analytics Providers:</strong> Vercel for usage analyticsd<strong>Infrastructure Providers:</strong> For hosting and content deliveryd5.2 Legal Requirements. We may disclose your information if required to do so by law or in response to valid requests by public authorities"
    },
    {
      "id": "6",
      "title": "Your Rights and Choices",
      "description": "6.1 Access and Control. Since our service operates without user accounts, traditional data access rights work differently You control your data through share codesdContent is automatically deleted after expirationdYou can request manual deletion by contacting usd6.2 GDPR Rights (EU Users). If you are in the European Union, you have the following rights <strong>Right of Access:</strong> Request information about data we processd<strong>Right to Rectification:</strong> Request correction of inaccurate datad<strong>Right to Erasure:</strong> Request deletion of your datad<strong>Right to Restrict Processing:</strong> Request limitation of data processingd<strong>Right to Data Portability:</strong> Request transfer of your datad<strong>Right to Object:</strong> Object to processing of your datad6.3 CCPA Rights (California Users). If you are a California resident, you have the following rights Right to know what personal information is collecteddRight to delete personal informationdRight to opt-out of the sale of personal information (we do not sell data)dRight to non-discrimination for exercising your privacy rightsd"
    },
    {
      "id": "7",
      "title": "Cookies and Tracking",
      "description": "Our service uses minimal tracking technologies <strong>Essential Cookies:</strong> Required for service functionality (theme preferences)d<strong>Analytics Cookies:</strong> Vercel Analytics for usage statisticsd<strong>No Advertising Cookies:</strong> We do not use cookies for advertising purposesd"
    },
    {
      "id": "8",
      "title": "International Data Transfers",
      "description": "Your information may be transferred to and maintained on computers located outside of your state, province, country, or other governmental jurisdiction where data protection laws may differ. By using our service, you consent to this transfer"
    },
    {
      "id": "9",
      "title": "Children and Privacy",
      "description": "Our service is not intended for children under 13 years of age. We do not knowingly collect personal information from children under 13. If you become aware that a child has provided us with personal information, please contact us"
    },
    {
      "id": "10",
      "title": "Data Breach Notification",
      "description": "In the event of a data breach that affects your personal information, we will notify you and relevant authorities as required by applicable law within 72 hours of becoming aware of the breach"
    },
    {
      "id": "11",
      "title": "Third-Party Links",
      "description": "Our service may contain links to third-party websites. We are not responsible for the privacy practices or content of these third-party sites. We encourage you to review their privacy policies"
    },
    {
      "id": "12",
      "title": "Changes to This Privacy Policy",
      "description": "We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the &ldquo;Last updated&rdquo; date. Changes are effective immediately upon posting"
    },
    {
      "id": "13",
      "title": "Contact Us",
      "description": "If you have any questions about this Privacy Policy or our privacy practices, please contact us through the information provided on our website"
    },
    {
      "id": "14",
      "title": "Data Controller Information",
      "description": "For the purposes of EU data protection law, Clipposaurus is the data controller of your personal information. We are committed to ensuring that your privacy is protected in accordance with applicable data protection laws"
    },
    {
      "id": "15",
      "title": "Legal Basis for Processing (GDPR)",
      "description": "We process your personal information based on the following legal grounds <strong>Legitimate Interest:</strong> To provide and improve our serviced<strong>Consent:</strong> For analytics and non-essential featuresd<strong>Legal Obligation:</strong> To comply with applicable lawsd<strong>Contract:</strong> To fulfill our terms of serviced"
    }
  ]
}
